{
  "title": "Building Voice Agents with ElevenLabs Conversational AI",
  "date": "2025-04-22T00:00:00.000Z",
  "description": "Lessons from building a voice-based chatbot for customer service training",
  "categories": [
    "Voice",
    "LLM",
    "Deployment"
  ],
  "authors": [
    "ivanleomk"
  ],
  "content": "\n# Building Voice Applications with ElevenLabs Agents\n\nVoice-based AI applications represent the next frontier in customer service training, offering a more natural and effective alternative to traditional methods. They create consistent, risk-free practice environments where trainees can master complex interactions before facing real customers.\n\nTo build great user experiences with these voice agents, there are three critical design principles to keep in mind\n\n- Thoughtful Context Design: Creating authentic scenarios using real-world data like actual menus and service protocols\n- Strategic Randomization: Implementing controlled variability that builds adaptability rather than rote responses\n- Skill-Targeted Scenarios: Focusing on specific competencies rather than general conversation abilities\n\nThis article unpacks the practical lessons learned while building a voice-based training solution with ElevenLabs's new conversational AI that enables flight attendants to perfect premium cabin service interactions—without risking passenger satisfaction or airline reputation during the learning process.\n\n## Thoughtful Context Design\n\nUnlike text interfaces, voice applications demand authentic context to create meaningful interactions. My flight attendant training simulator succeeded largely because it was grounded in real-world data and scenarios.\n\nThe goal is to think carefully about what customers would actually need or request in real-world situations. For business class service, this means considering:\n\n- **Menu details**: Including 3-4 different wines, 4 different main courses, appetizers, entrees, and snacks\n- **Dietary information**: Common allergens, ingredient details, and alternative options\n- **Customization requests**: Such as vegetarian meals not pre-ordered or special preparations\n- **Common inquiries**: \"Is this dish spicy?\", \"Does this contain nuts?\", \"Can my family get something different?\"\n\nThis grounding in reality creates authentic interaction contexts that matter more than technical sophistication. Trainees reported that the scenarios felt genuinely similar to their daily passenger interactions precisely because the prompts incorporated these real-world elements.\n\nTo implement effective context design:\n\n1. **Map the actual customer journey**: Identify the specific problems flight attendants face in real service situations\n2. **Incorporate authentic reference materials**: Use real airline menus, service protocols, and flight schedules\n3. **Design flexible prompt structures**: Allow for customization based on the specific training goal for the day\n\nThis thoughtful context design enables trainees to practice responding to authentic scenarios rather than generic conversations, preparing them for the true complexity of premium cabin service.\n\n## Strategic Randomization\n\nVoice applications become far more effective when they introduce controlled variability. This creates diverse scenarios that build adaptability rather than rote responses.\n\n### Dynamic Persona Generation\n\nLarge language models, when prompted repeatedly with the same input, tend to generate similar outputs - for example, asking for a joke repeatedly might yield the same 5-10 jokes. To overcome this limitation, I injected strategic sources of entropy that made sense for the training context.\n\nUsing faker.js, I generated random passenger profiles with realistic variations:\n\n```javascript\nName: ${faker.person.fullName()}\nJob Title: ${faker.person.jobTitle()}\nAge: ${faker.number.int({ min: 25, max: 60 })}\nPurpose: ${Math.random() > 0.5 ? \"Business\" : \"Leisure\"}\nLast Visited Country: ${faker.location.country()}\nFlights per year: ${faker.number.int({ min: 1, max: 10 })}\n```\n\nThis provided the AI with different contextual elements to condition its responses on. Importantly, the user interface allowed trainees to modify these attributes, creating a collaborative process for designing practice scenarios that mapped to real customer types they wanted to prepare for.\n\n### Varied Conversation Starters\n\nThe second form of randomization came through dynamically selected first messages. I created an array of potential opening lines that a passenger might use:\n\n```javascript\nconst potentialFirstMessages = [\n  \"Hi there, when is the meal service going to start?\",\n  \"Excuse me, I'm wondering about the meal service timing\",\n  \"I have some dietary restrictions. Could you tell me which meal options are vegetarian?\",\n  \"I'd love to try the Pork Cheek Au Jus. Is that available on this flight?\",\n  \"I'm interested in trying some of your signature cocktails. What do you offer?\",\n  \"Could I get an extra pillow and blanket for the flight?\",\n  // Many more variations...\n];\n```\n\nBy randomly selecting from these options and injecting them as the first message, I forced the agent to respond as a passenger with varying needs and requests. This approach expanded the range of conversations trainees would encounter, preventing them from developing scripted responses to predictable scenarios.\n\nThe key insight is finding the right balance of randomization for your specific use case - enough variation to build adaptability, but constrained within realistic parameters that align with the actual challenges users will face in their roles.\n\n### Applied Randomization in Production\n\nThis strategic randomization approach extends beyond training scenarios to production applications as well. For example, when building a voice bot for a restaurant or gym:\n\n1. Analyze common requests: Study what actual customers typically ask for when they call\n2. Craft targeted first messages: Rather than generic greetings like \"How's your day?\" or irrelevant information, design contextually appropriate starters\n3. Guide the conversation flow: For an order-taking bot, consider something like: \"Thanks for calling our restaurant! We have a great promotion today on General Tso's chicken with a new side. Would you be interested in that, or can I help you with something else?\"\n\nBy carefully managing the context and deliberately directing the conversation flow, you can build much richer experiences not just for voice agents but for chatbots and any interactive application. The goal isn't complete randomness but rather thoughtful variation within appropriate boundaries that move interactions in productive directions.\n\n## Skill-Targeted Scenarios\n\nThe most effective voice applications focus on developing specific competencies rather than general conversation abilities. This approach requires understanding the actual skills users need to master in their real-world context.\n\n### Identifying Core Competencies\n\nFor flight attendants training for business class service, the key competencies include:\n\n- **Offering appropriate recommendations** from menu options\n- **Handling difficult interactions** with professionalism\n- **Using proper language and phrasing** (\"Good evening Mr. Tan, is there anything I can help you with today?\" rather than casual speech)\n- **Delivering service with the expected formality** (\"It's my pleasure, sir\")\n\nBy analyzing the specific skills that define success in a role, you can design targeted scenarios that build these competencies rather than generic conversational ability.\n\n### Designing for Skill Development\n\nThis means creating different system prompts or scenarios that focus on particular skill areas:\n\n- Scenarios for practicing menu recommendations\n- Scenarios for de-escalating passenger complaints\n- Scenarios that test knowledge of service procedures\n\nThese can be generated randomly or hard-coded based on the training needs, but each should target a specific competency rather than general conversation.\n\n### Refining Through Production Data\n\nAfter deploying to production, you can further refine these targeted scenarios by:\n\n- **Topic modeling** to identify clusters of common interactions\n- **Categorizing conversations** into general request types\n- **Identifying pain points** where users struggle most\n\nThis data-driven approach allows you to build specialized paths or competencies for your voice agents. For example, if location questions dominate customer inquiries (\"Are you near Baker Street?\"), you can create dedicated modules that excel at handling geographical information.\n\nThe key insight is that voice agents should not aim for general conversational ability, but rather master the specific competencies that matter most in their application context. This targeted approach delivers more effective training outcomes and creates more useful production applications.\n\n## Conclusion\n\nThe success of voice applications depends far more on thoughtful interaction design than on technical implementation. By focusing on authentic context, strategic randomization, and targeted skill development, I created an effective flight attendant training simulator that delivers genuine value.\n\nElevenLabs dramatically simplifies the technical implementation, allowing developers to focus on what matters most: creating voice experiences that feel natural, responsive, and valuable to users. The platform's constraints actually encourage more thoughtful design choices, focusing energy on creating meaningful content rather than wrestling with technical implementation.\n\nFor applications like training simulations, customer service practice, or voice interfaces requiring quick deployment, success depends on thoughtful design that considers the specific skills being developed, the context needed for authentic experiences, and the strategic introduction of variability to build adaptability.\n\nThe most valuable insight from this project is that voice agents aren't a panacea - they're a tool that requires deliberate planning and user empathy to create truly effective experiences. With careful context design, strategic randomization, and skill-targeted scenarios, voice applications can create powerful, immersive learning experiences that translate directly to real-world skills.\n",
  "slug": "building-voice-with-eleven-labs"
}