{
  "title": "Why User Intent matters the most for Synthetic Data",
  "date": "2024-11-29T00:00:00.000Z",
  "description": "The easiest thing you can do today to improve your synthetic data quality",
  "categories": [
    "Synthetic Data",
    "Evals"
  ],
  "authors": [
    "ivanleomk"
  ],
  "content": "\n# Why User Intent matters the most for Synthetic Data\n\n## Introduction\n\nI've generated millions of tokens worth of synthetic data over the last few weeks, and I've learned something surprising: everyone talks about using different personas or complex question structures when creating synthetic data, but they're missing what really matters.\n\nThe most important thing is actually understanding why users are asking their questions in the first place - their intent.\n\nLet's explore this concept using [Peek](https://peek.money), an AI personal finance bot, as our case study.\n\nBy examining how synthetic data generation evolves from basic documentation-based approaches to intent-driven synthesis, we'll see why focusing on user intent produces more valuable training data.\n\nI've scraped their FAQ into a markdown document ahead of time and used it to generate some synthetic queries.\n\n??? note \"Download Peek's FAQ\"\n\n    Here is a FAQ that I generated for Peek based off their actual FAQ\n\n    ```markdown\n    ## What is Peek?\n\n    Peek is an AI-powered personal finance platform to help you track, manage and grow your net worth.\n\n    ## Security & Privacy\n\n    ### Is my financial data secure with Peek?\n\n    Your financial data is encrypted at-rest and in-transit. This means that your data is protected from unauthorized access. Even if the database files were to be stolen, the thieves wouldn't be able to decrypt the contents without the decryption keys. In addition, the decryption keys are secured by Amazon Web Service's Key Management Service, which makes use of industry standard hardware security modules.\n\n    Data transfers between your browser and our servers are also encrypted with secured HTTPS connections, so your data will still be secured even if it was intercepted by a hacker.\n\n    ### Does Peek.money sell or share my data with other financial institutions?\n\n    No, we do not sell or share your data to other financial institutions. That is simply not our business model.\n\n    ### Can Peek.money access my bank or brokerage accounts directly?\n\n    No, Peek.money does not have direct access to your bank or brokerage accounts.\n\n    ### Can I request to delete my data from Peek?\n\n    Yes, you can request to delete your data from Peek.money at any time. Simply contact our customer support team at support@peek.money, and we will guide you through the process of permanently deleting your account and all associated data.\n\n    ### Does Peek use my data internally?\n\n    With your consent and opt-in, we use your data to provide anonymised benchmarking data and insights. Other than that, we do not use your data in respect of your privacy.\n\n    ### What happens to my data if Peek.money is acquired or goes out of business?\n\n    In the event that Peek.money is acquired or goes out of business, we will ensure that your data is protected and treated in accordance with our privacy policy. We will notify you of any changes to our business and provide you with the opportunity to delete your data if desired.\n\n    ## Service & Features\n\n    ### Is Peek providing financial advice?\n\n    No, we are not. Think of Peek as your personal financial analyst. As such, it can analyse your data and give you new perspectives but it won't be able to buy or employ specific strategies.\n\n    ### How many assets do you support?\n\n    We support more than 70,000 assets across banks, exchanges, cryptocurrencies, and more in different markets.\n\n    ### I can't find the asset that I am holding. What should I do?\n\n    Please email us at support@peek.money and we'll figure out how best to support such assets.\n\n    ### How often is my portfolio data updated?\n\n    Portfolio data is updated daily for most assets. Cryptocurrency values are updated in near real-time, while traditional investment vehicles and bank accounts are typically updated at the end of each trading day.\n\n    ### Can I track multiple currencies?\n\n    Yes, Peek supports multiple currencies and automatically converts all values to your preferred base currency for consolidated reporting. Exchange rates are updated daily.\n\n    ### Is there a mobile app available?\n\n    Yes, Peek is available on both iOS and Android devices. You can download the app from the App Store or Google Play Store and access your portfolio on the go.\n\n    ### What types of analytics and insights does Peek provide?\n\n    Peek offers various analytical tools including:\n\n    - Portfolio performance tracking and benchmarking\n    - Asset allocation analysis\n    - Risk assessment\n    - Expense tracking and categorization\n    - Net worth trending over time\n    - Custom goal setting and tracking\n\n    ### What is the subscription cost?\n\n    Peek offers different subscription tiers to suit various needs. Please visit our pricing page at peek.money/pricing for current subscription options and features included in each tier.\n\n    ### Can I export my data?\n\n    Yes, you can export your portfolio data, transaction history, and analysis reports in various formats including CSV, PDF, and Excel files.\n\n    ### How do I get started?\n\n    Getting started with Peek is simple. Create an account at peek.money, verify your email, and begin adding your assets. We provide step-by-step guidance to help you set up your portfolio effectively.\n\n    ### What kind of customer support do you offer?\n\n    We offer customer support through multiple channels:\n\n    - Email support at support@peek.money\n    - In-app chat support during business hours\n    - Comprehensive help center with guides and tutorials\n    - Community forum for peer discussions and tips\n    ```\n\n## The Evolution of Synthetic Data Generation\n\n### Level 1: Documentation-Based Generation\n\nMost teams start with their product documentation, using it to generate questions they think users might ask. Here's a basic implementation:\n\n```python\nasync def generate_synthetic_questions(context, num_questions=10, model=\"gpt-4o-mini\"):\n    class SyntheticQuestion(BaseModel):\n        chain_of_thought: str\n        question: str\n        answer: str\n\n    client = instructor.from_openai(openai.AsyncOpenAI())\n    async def generate_question():\n        return await client.chat.completions.create(\n            messages=[{\n                \"role\": \"user\",\n                \"content\": \"Generate a hypothetical question based off the following context {{ context }}\"\n            }],\n            context={\"context\": context},\n            response_model=SyntheticQuestion,\n            model=model,\n        )\n```\n\nUsing Peek's FAQ as input, this approach generates questions like:\n\n- \"What rights do I have regarding the deletion of my data?\"\n- \"What measures does Peek take to ensure my financial data remains secure?\"\n- \"What happens if the company undergoes significant operational changes?\"\n\nWhile these questions are technically valid, they're almost one-to-one mappings from the documentation. They don't reflect how users naturally interact with a financial application.\n\nIf all we needed was to answer documentation-based questions, a simple search system using BM25 or embeddings would suffice.\n\n### Level 2: Adding Personas and Context\n\nThe next evolution introduces personas and contextual variations:\n\n```python\npersonas = [\n    \"A student looking to improve their finances\",\n    \"A working adult managing finances for the first time\",\n    \"A retiree looking to maximize retirement income\",\n    \"A working adult saving for their first home\",\n]\n```\n\nThis approach produces more specific questions like:\n\n- \"As a student using Peek to track my expenses and savings, how secure is my financial data?\"\n- \"As a working adult, is my financial data safe with Peek while I save for my first home?\"\n\nWe see more variation in tone and context, and the questions become more personalized. However, this approach still doesn't fully capture why users come to the application in the first place.\n\n### Level 3: Intent-Based Generation\n\n> Since I don't know that much about how people actually use Peek I just asked O1 to [generate potential user intents in this chat](https://chatgpt.com/share/67492038-3770-8011-bd5d-d916161bf3b7). It's been a very helpful tool for me for brainstorming, highly recommend!\n\nThe real breakthrough comes from focusing on user intents. When we examine how people actually use a personal finance application like Peek, we see questions like:\n\n- \"Is there a guide on how to use the asset allocation feature?\"\n- \"Can you help me find all my expenses over $200 for the past month?\"\n- \"How can I adjust my savings plan to retire five years earlier without sacrificing my current lifestyle?\"\n\nThese questions reflect specific user intents:\n\n- Learning to use platform features\n- Understanding spending trends\n- Planning for major life changes\n\nBy thinking carefully about how users are going to interact with our product, we can randomly sample from these intents or even combine different intents together to generate more complex queries.\n\nThis allows us to stress test different aspects of our application's capabilities in a way that simple personas cannot.\n\n```python\nintents = {\n    \"Feature Discovery\": {\n        \"description\": \"Users learning platform features\",\n        \"examples\": [\"How do I use the asset allocation tool?\"]\n    },\n    \"Investment Analysis\": {\n        \"description\": \"Users analyzing portfolio composition\",\n        \"examples\": [\"Show me my investment diversity\"]\n    },\n    \"Life Planning\": {\n        \"description\": \"Users planning major financial changes\",\n        \"examples\": [\"How can I retire 5 years earlier?\"]\n    }\n}\n```\n\nThe key is mapping these intents to the actual capabilities of an application like peek for instance\n\n- Transaction Retrieval Functions\n- Portfolio Analysis Tools\n- Financial Planning calculators\n\nWhile you can use any framework of your choice, using instructor we can convert these intents to Pydantic objects that have executable methods. This abstracts away the complexity of orchestrating different tools and separates the planning of the response from the execution.\n\n```python\nclass FinancialQuery(BaseModel):\n    intent: str\n    query: str\n\n    def execute(self):\n            return self.fetch_feature_documentation()\n```\n\n### Level 4: Grounding in Real User Data\n\nWhile understanding user intent helps generate better synthetic data, there's no substitute for real user interactions. The most effective approach is to regularly sample actual user queries and evaluate how your system performs.\n\nThis helps you identify new patterns in how users phrase questions, areas where your system struggles, and whether your synthetic data still reflects reality. By grounding your synthetic data in real usage patterns, you ensure your testing remains relevant to what users actually care about.\n\nThe goal isn't to have perfect synthetic data, but rather to have synthetic data that helps you build and test the capabilities your users actually need\n\n## Conclusion\n\nWhile personas and query variations are useful tools, the key to generating valuable synthetic data lies in understanding user intent. By focusing on why users interact with your application and mapping those intents to specific capabilities, you can create synthetic data that truly helps improve your application's performance.\n\nRemember: synthetic data is just a tool. The goal isn't to generate massive volumes of queries, but to create focused test cases that verify your application can understand and respond to real user needs effectively.\n",
  "slug": "generating-user-queries"
}